abbrs = {
    'ОСФ':'Орган сравнения фаз',
    'КИТЦ':'Контроль исправности токовых цепей',
    'КИЦТ':'Контроль исправности токовых цепей - неправильная абр',
    'ЗП':'Защита от перегрузки',
    'ЗПО':'Защита от потери охлаждения',
    'УРОВ':'Устройство резервирования при отказе выключателя',
    'ТЗНП':'Токовая защита нулевой последовательности',
    'ТЗОП':'Токовая защита обратной последовательности',
    'ФСУ':'Функционально-структурная схема',
    'ЗПНОП':'Защита от повышения напряжения обратной последовательности',

}