
dict_default = {
    'Независимая': 'Не\-за\-ви\-симая',
    'Ненаправленная':  'Не\-на\-прав\-лен\-ная',
    'Направленность':  'На\-прав\-ленность',
    'Характеристика':  'Харак\-терис\-тика',
}

# В ЭТОМ СЛОВАРЕ СИМВОЛ x - ЭТО ЛАТИНСКИЙ!
dict_func = {
    'ТЗ Т': 'Технологические защиты трансформатора',
    'ТЗНП':  'Токовая защита нулевой последовательности',
    'ЛО ГЗоткл':  'Логика отключения при срабатывании отключающего контакта газового реле',
    'ЛО ГЗсигн':  'Логика отключения при срабатывании сигнального контакта газового реле',
    'ЛО ГЗ РПН':  'Логика отключения при срабатывании контакта струйного реле РПН',
    'ЛО ТЗ':  'Логика отключения при срабатывании технологических защит',
    'ЛО ТС':  'Логика отключения при срабатывании технологической сигнализации',           
    'ЗПО':  'Защита от потери охлаждения',
    'ЛО В ВН':  'Логика отключения выключателя стороны ВН',    
    'ЛО В НН':  'Логика отключения выключателя ввода стороны НН',
    'ЛО В ННx':  'Логика отключения выключателя ввода стороны ННx',
    'УРОВ':  'Устройство резервирования отказов выключателя - проверить обозначение!',
    'КЦТ':  'Контроль цепей тока',
    'ДЗТ':  'Дифференциальная токовая защита трансформатора',
    'ТО ЗПО':  'Токовые органы защиты от потери охлаждения',
    'ЗП':  'Защита от перегрузки',
    'РТПО':  'Токовые органы пуска охлаждения',
    'ТК ЗДЗ':  'Токовый контроль для дуговой защиты',
    'ТО РПН':  'Токовый контроль для блокировки РПН',                            
}

long_table_header_desc = '\\begin{longtable}[l]{|>{\centering\\arraybackslash}m{0.3cm}|>{\centering\\arraybackslash}m{4cm}|>{\centering\\arraybackslash}m{1.7cm}|>{\centering\\arraybackslash}m{3cm}|>{\centering\\arraybackslash}m{1cm}|>{\centering\\arraybackslash}m{1.5cm}|>{\centering\\arraybackslash}m{1.6cm}|>{\centering\\arraybackslash}m{1.5cm}|}'

long_table_header = [
'\hline',
'\\rowcolor{gray!30}',
'№ & Параметр (Параметр на ИЧМ) & Обозначение на схеме & Значение/ Диапазон & Ед. изм. & Шаг & По умолчанию & Значение ' + r'\\',
'\hline',
'\endfirsthead',
'\caption{\emph{Продолжение\hfill\\vspace{-0.5\\baselineskip}}}' + r'\\',
'\hline',
'\\rowcolor{gray!30}',
'№ & Параметр (Параметр на ИЧМ) & Обозначение на схеме & Значение/ Диапазон & Ед. изм. & Шаг & По умолчанию & Значение ' + r'\\',
'\hline',
'\endhead',                       
'\hline',
'\endfoot',                       
'\hline',
'\endlastfoot'
]

